Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you are using RESTEasy and JAX-RS, you can inject various AWS Context variables into your JAX-RS resource classes using the JAX-RS `@Context` annotation.
ja_jp: RESTEasy と JAX-RS を使用している場合、JAX-RS `@Context` アノテーションを使用して、様々な AWS Context 変数を JAX-RS リソースクラスに注入できます。

source: If you are using RESTEasy, in the context of a JAX-RS endpoint, Hibernate Validator will automatically resolve the optimal locale to use from the `Accept-Language` HTTP header, provided the supported locales have been properly specified in the `application.properties`:
ja_jp: RESTEasyを使用している場合、JAX-RSエンドポイントのコンテキストでは、 サポートされるロケールが `application.properties` で適切に指定されている場合、Hibernate Validatorが使用する最適なロケールを `Accept-Language` HTTPヘッダから自動的に解決します。

source: If you are using Servlet you can control the Servlet context path via `quarkus.servlet.context-path`. This item is relative to the http root above, and will only affect Servlet and things that run on top of Servlet. Most applications will want to use the HTTP root as this affects everything that Quarkus serves.
ja_jp: Servlet を使用している場合は、`quarkus.servlet.context-path` を通して Servlet のコンテキストパスを制御することができます。この項目は、上記の http ルートに相対的で、Servlet と、Servlet の上で実行されるものにのみ影響します。多くのアプリケーションでは、Quarkus が提供するすべてのサービスに影響するため、HTTP ルートを使用することをお勧めします。

source: If you are using `META-INF/services` files you need to register the files as resources so that your native image can find them, but you also need to register each listed class for reflection so they can be instantiated or inspected at run-time:
ja_jp: `META-INF/services` ファイルを使用している場合は、ネイティブイメージがそのファイルを見つけられるように、ファイルをリソースとして登録する必要があります。ただし、ランタイムでインスタンス化または検査できるように、リストされた各クラスをリフレクション用に登録する必要もあります。

source: If you are using `quarkus.http.root-path`, ensure you include the root path in the configuration.
ja_jp: `quarkus.http.root-path` を使用している場合は、設定にルートパスを含めるようにしてください。

source: If you are using a Docker image to build, then you must extract these files from this image.
ja_jp: Dockerイメージを使ってビルドする場合は、このイメージからこれらのファイルを抽出する必要があります。

source: If you are using a Java 19 or 20, add the `--enable-preview` flag in the `argLine` and as `parameters` of the maven compiler plugin. Note that we strongly recommend Java 21.
ja_jp: Java 19 または 20 を使用している場合は、 `argLine` に `--enable-preview` フラグを追加するか、 Maven コンパイラ・プラグインの `parameters` に `--enable-preview` フラグを追加してください。 Java 21を強くお勧めします。

source: If you are using a Mac M1 or M2 (using an ARM64 CPU), you need to be aware that the native executable you will get using an in-container build will be a Linux executable, but using your host (ARM 64) architecture. You can use emulation to force the architecture when using Docker with the following property:
ja_jp: Mac M1 または M2 (ARM64 CPU を使用) を使用している場合、コンテナー内ビルドを使用して取得するネイティブ実行可能ファイルは Linux 実行可能ファイルですが、ホスト (ARM64) アーキテクチャーを使用していることに注意する必要があります。 以下のプロパティーで Docker を使用する際に、エミュレーションを使用して強制的にアーキテクチャーを変更することができます。

source: If you are using a `web.xml` file as your configuration file, you can place it in the `src/main/resources/META-INF` directory.
ja_jp: 設定ファイルとして `web.xml` を使用している場合は、`src/main/resources/META-INF` ディレクトリーに配置します。

source: If you are using a project generated by our tooling, adding `-DskipITs=false` makes sure the integration tests will be run.
ja_jp: ツールによって生成されたプロジェクトを使用している場合、 `-DskipITs=false` を追加することで統合テストが確実に実行されるようになります。

source: If you are using a project generated by our tooling, integration tests are disabled by default. Adding `-DskipITs=false` makes sure they will be run.
ja_jp: 私たちのツールで生成されたプロジェクトを使用している場合、統合テストはデフォルトで無効になっています。`-DskipITs=false` を追加することで、それらが実行されるようになります。

source: If you are using a proprietary database such as DB2 or MSSQL you will need to accept the license agreement. To do this create a `src/main/resources/container-license-acceptance.txt` files in your project and add a line with the image name and tag of the database. By default, Quarkus uses the default image for the current version of Testcontainers, if you attempt to start Quarkus the resulting failure will tell you the exact image name in use for you to add to the file.
ja_jp: DB2 や MSSQL のような独自データベースを使用している場合、ライセンス契約に同意する必要があります。これを行うには、プロジェクト内に `src/main/resources/container-license-acceptance.txt` ファイルを作成し、データベースのイメージ名とタグを記載した行を追加します。デフォルトでは、Quarkus は現在の Testcontainers バージョンのデフォルトイメージを使用します。Quarkus を起動しようとすると失敗し、使用中の正確なイメージ名が表示されますので、それをファイルに追加してください。

source: If you are using a proprietary database such as DB2 or MSSQL you will need to accept the license agreement. To do this create a `src/main/resources/container-license-acceptance.txt` files in your project and add a line with the image name and tag of the database. By default Quarkus uses the default image for the current version of Testcontainers, if you attempt to start Quarkus the resulting failure will tell you the exact image name in use for you to add to the file.
ja_jp: DB2やMSSQLなどのプロプライエタリなデータベースを使用している場合は、使用許諾契約書に同意する必要があります。これを行うには、プロジェクト内に `src/main/resources/container-license-acceptance.txt` ファイルを作成し、データベースのイメージ名とタグを記載した行を追加します。デフォルトでは、Quarkusは現在のバージョンのTestcontainersのデフォルトイメージを使用しますが、Quarkusを起動しようとすると、失敗したときに使用されている正確なイメージ名が表示されるので、ファイルに追加してください。

source: If you are using an extension that is missing or not working, please open issues in their respective issue tracker systems.
ja_jp: もし、エクステンションがない、または動作しない場合は、それぞれのIssueトラッキングシステムでIssueを開いてください。

source: If you are using an untrusted certificate, enable certificate trust for the `KubernetesClient`:
ja_jp: 信頼されていない証明書を使用している場合は、 `KubernetesClient` の証明書の信頼を有効にします：

source: If you are using dependencies that require logging components such as Apache Commons Logging or Log4j and are experiencing a `ClassNotFoundException` when building the native executable, you can resolve this by excluding the logging library and adding the corresponding JBoss Logging adapter.
ja_jp: Apache Commons Logging や Log4j などのロギングコンポーネントを必要とする依存関係を使用していて、ネイティブ実行可能ファイルをビルドする際に `ClassNotFoundException` が発生する場合、ロギングライブラリーを除外し、対応する JBoss Logging アダプターを追加することで解決できます。

source: If you are using https://mvnpm.org[mvnpm], like the following Lit one:
ja_jp: 以下の Lit のような https://mvnpm.org[mvnpm] を使用している場合は、

source: If you are using https://www.webjars.org[WebJars], like the following JQuery one:
ja_jp: 以下の JQuery のような https://www.webjars.org[WebJars] を使用している場合は、

source: If you are using libraries that have dependencies on other logging libraries such as Apache Commons Logging, Log4j or SLF4J, you need to exclude them from the dependencies and use one of the adapters provided by JBoss Logging.
ja_jp: Apache Commons Logging、Log4j、Slf4j などの他のロギングライブラリに依存関係があるライブラリを使用している場合は、それらを依存関係から除外し、JBoss Logging が提供するアダプターのいずれかを使用する必要があります。

source: If you are using link:http://smallrye.io/smallrye-mutiny[Mutiny] (the `quarkus-mutiny` extension), you just need to add the the `quarkus-smallrye-context-propagation` extension to enable context propagation.
ja_jp: link:http://smallrye.io/smallrye-mutiny[Mutiny] ( `quarkus-mutiny` のエクステンション) を使用している場合は、コンテキストの伝播を有効にするために `quarkus-smallrye-context-propagation` のエクステンションを追加するだけです。

source: If you are using link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/concurrent/CompletionStage.html[`CompletionStage`] you need manual context propagation. You can do that by injecting a `ThreadContext` or `ManagedExecutor` that will propagate every context. For example, here we use the xref:vertx.adoc[Vert.x Web Client] to get the list of Star Wars people, then store them in the database using xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] (all in the same transaction) before returning them to the client as JSON using xref:rest-json.adoc[Jackson or JSON-B]:
ja_jp: link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/concurrent/CompletionStage.html[`CompletionStage`]を使っている場合は、手動でのコンテキストの伝播が必要です。そのためには、すべてのコンテキストを伝搬する `ThreadContext` または `ManagedExecutor` を注入することができます。例えば、ここでは link:vertx.html[Vert.x Web Client]を使用してStar Warsの人々のリストを取得し、 link:hibernate-orm-panache.html[Panacheを使用したHibernate ORM]を使用してデータベースに格納し（すべて同じトランザクションで）、 link:rest-json.html[JacksonまたはJSON-B]を使用してJSONとしてクライアントに返しています:

source: If you are using link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/concurrent/CompletionStage.html[`CompletionStage`] you need manual context propagation. You can do that by injecting a `ThreadContext` or `ManagedExecutor` that will propagate every context. For example, here we use the xref:vertx.adoc[Vert.x Web Client] to get the list of Star Wars people, then store them in the database using xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] (all in the same transaction) before returning them to the client as JSON using xref:rest-json.adoc[Jackson or JSON-B]:
ja_jp: もし link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/concurrent/CompletionStage.html[CompletionStage] を使っている場合は、 コンテキストの伝播を手動で行う必要があります。 すべてのコンテキストを伝搬する `ThreadContext` または `ManagedExecutor` を注入することで、それを行うことができます。 例えば、ここでは xref:vertx.adoc[Vert.x Web Client] を使用してStar Warsの人物のリストを取得し、 xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] を使用してデータベースに格納してから（すべて同じトランザクションで）、 xref:rest-json.adoc[JacksonまたはJSON-B] を使用してJSONとしてクライアントに返します：

source: If you are using link:https://smallrye.io/smallrye-mutiny[Mutiny] (the `quarkus-mutiny` extension), you just need to add the `quarkus-smallrye-context-propagation` extension to enable context propagation.
ja_jp: link:http://smallrye.io/smallrye-mutiny[Mutiny] ( `quarkus-mutiny` のエクステンション) を使用している場合は、コンテキスト伝播を有効にするために `quarkus-smallrye-context-propagation` のエクステンションを追加するだけです。

source: If you are using our Spring Data compatibility layer, you can now benefit from the Spring Data REST extension to simplify writing a CRUD REST layer. It is very similar to our REST with Panache extension.
ja_jp: 弊社のSpring Data互換レイヤーを使用している場合、Spring Data RESTエクステンションの恩恵を受けて、CRUD RESTレイヤーの記述を簡単にすることができます。これはREST with Panacheエクステンションと非常に似ています。

source: If you are using the CLI, you can get the list of available options with:
ja_jp: CLIを使用している場合、次のように利用可能なオプションのリストを取得することが可能です。

source: If you are using the Jandex Maven plugin or the Jandex Gradle plugin in your applications, you need to update them.
ja_jp: アプリケーションでJandex MavenプラグインやJandex Gradleプラグインを使用している場合は、それらをアップデートする必要があります。

source: If you are using the Maven command, the following table lists the attributes you can pass to the `create` command:
ja_jp: Maven コマンドを使用している場合、次の表が `create` コマンドに渡すことができる属性の一覧です。

source: If you are using the OpenShift image registry and pulling from image streams in the same project, your pod service account must already have the correct permissions.
ja_jp: OpenShiftのイメージレジストリを使用し、同じプロジェクト内のイメージストリームからプルしている場合、ポッドのサービスアカウントはすでに正しいパーミッションを持っている必要があります。

source: If you are using the Picocli extension, by default a Job resource will be generated.
ja_jp: Picocliエクステンションを使用している場合、デフォルトでJobリソースが生成されます。

source: If you are using the Picocli extension, by default the Job resource will be generated.
ja_jp: Picocli エクステンションを使用している場合、デフォルトで Job リソースが生成されます。

source: If you are using the Quarkus CLI - which is recommended - upgrade it to the latest and run:
ja_jp: Quarkus CLIを使用している場合（推奨）、最新のものにアップグレードして実行してください：

source: If you are using the Quarkus SmallRye Health extension, then the Cassandra client will automatically add a readiness health check to validate the connection to the Cassandra cluster. This extension is already included in this guide's pom.xml, but if you need to include it manually in your application, add the following:
ja_jp: Quarkus SmallRye Health エクステンションを使用している場合には、Cassandra クライアントは、Cassandra クラスターへの接続を検証するための準備ヘルスチェックを自動的に追加します。このエクステンションは、本書の pom.xml にすでに含まれていますが、アプリケーションに手動で含める必要がある場合は、次を追加してください。

source: If you are using the Quarkus-provided `Dockerfile` in JVM mode, you can disable renegotiation by adding the property to the `JAVA_OPTS_APPEND` environment variable:
ja_jp: Quarkus が提供する `Dockerfile` を JVM モードで使用している場合は、`JAVA_OPTS_APPEND` 環境変数にプロパティーを追加することで、再ネゴシエーションを無効化できます。

source: If you are using the `quarkus-hibernate-orm-panache` or `quarkus-mongodb-panache` extensions, check out the xref:hibernate-orm-panache.adoc#mocking[Hibernate ORM with Panache Mocking] and xref:mongodb-panache.adoc#mocking[MongoDB with Panache Mocking] documentation for the easiest way to mock your data access.
ja_jp: `quarkus-hibernate-orm-panache` や `quarkus-mongodb-panache` のエクステンションを使っている場合は、xref:hibernate-orm-panache.adoc#mocking[Hibernate ORM with Panache モック] および xref:mongodb-panache.adoc#mocking[MongoDB with Panache モック]のドキュメントをチェックして、データアクセスをモックする最も簡単な方法を確認してください。

source: If you are using the `quarkus-micrometer` or `quarkus-smallrye-metrics` extension, `quarkus-agroal` can expose some data source metrics on the `/q/metrics` endpoint. This can be turned on by setting the property `quarkus.datasource.metrics.enabled` to true.
ja_jp: `quarkus-micrometer` または `quarkus-smallrye-metrics` エクステンションを使用している場合、 `quarkus-agroal` は `/q/metrics` エンドポイントでいくつかのデータソースメトリクスを公開できます。これは、プロパティー `quarkus.datasource.metrics.enabled` を true に設定することで有効にすることができます。

source: If you are using the `quarkus-micrometer` or `quarkus-smallrye-metrics` extension, `quarkus-mongodb-client` can provide metrics about the connection pools. This behavior must first be enabled by setting the `quarkus.mongodb.metrics.enabled` property to `true` in your `application.properties`.
ja_jp: `quarkus-micrometer` または `quarkus-smallrye-metrics` エクステンションを使用している場合、 `quarkus-mongodb-client` は接続プールに関するメトリクスを提供することができます。この動作を有効にするには、まず `application.properties` の `quarkus.mongodb.metrics.enabled` プロパティーを `true` に設定する必要があります。

source: If you are using the `quarkus-micrometer`, `quarkus-mongodb-client` can provide metrics about the connection pools. This behavior must first be enabled by setting the `quarkus.mongodb.metrics.enabled` property to `true` in your `application.properties`.
ja_jp: `quarkus-micrometer` を使用している場合、`quarkus-mongodb-client` は接続プールに関するメトリクスを提供できます。この動作は、`application.properties` で `quarkus.mongodb.metrics.enabled` プロパティーを `true` に設定することで、最初に有効にする必要があります。

source: If you are using the `quarkus-smallrye-health` extension, `quarkus-kafka-streams` will automatically add:
ja_jp: `quarkus-smallrye-health` のエクステンションを使用している場合は、 `quarkus-kafka-streams` が自動的に以下を追加します:

source: If you are using the `quarkus-smallrye-health` extension, `quarkus-mongodb-client` will automatically add a readiness health check to validate the connection to the cluster.
ja_jp: `quarkus-smallrye-health` エクステンションを使用している場合、 `quarkus-mongodb-client` はクラスターへの接続を検証するためのReadinessヘルスチェックを自動的に追加します。

source: If you are using the `quarkus-smallrye-health` extension, `quarkus-redis` will automatically add a readiness health check to validate the connection to the Redis server.
ja_jp: `quarkus-smallrye-health` エクステンションを使用している場合、 `quarkus-redis` は Redis サーバーへの接続を検証するための readiness ヘルスチェックを自動的に追加します。

source: If you are using the `quarkus-smallrye-health` extension, `quarkus-vertx-redis` will automatically add a readiness health check to validate the connection to the Redis server.
ja_jp: `quarkus-smallrye-health` エクステンションを使用している場合、 `quarkus-vertx-redis` は、Redis サーバーへの接続を検証するためのreadiness ヘルスチェックを自動的に追加します。

source: If you are using the `quarkus-smallrye-health` extension, both extensions will automatically add a readiness health check to validate the health of the cluster.
ja_jp: `quarkus-smallrye-health` エクステンションを使用している場合、両エクステンションは自動的にreadinessヘルスチェックを追加して、クラスタの健全性を検証します。

source: If you are using the `quarkus-smallrye-health` extension, both the extension will automatically add a readiness health check to validate the health of the cluster.
ja_jp: `quarkus-smallrye-health` エクステンションを使用している場合、どちらのエクステンションも、クラスターの健全性を検証するための readiness ヘルスチェックを自動的に追加します。

source: If you are using the `quarkus-smallrye-health` extension, the `quarkus-agroal` and reactive client extensions will automatically add a readiness health check to validate the datasource.
ja_jp: `quarkus-smallrye-health` 拡張を使用している場合、 `quarkus-agroal` とリアクティブクライアント拡張は、データソースを検証するための準備の健全性チェックを自動的に追加します。

source: If you are using the `quarkus-smallrye-opentracing` extension, `quarkus-mongodb-client` can register traces about the commands executed. This behavior must be enabled by setting the `quarkus.mongodb.tracing.enabled` property to `true` in your `application.properties` and adding the dependency `io.opentracing.contrib:opentracing-mongo-common` to your pom.xml (for more info read the xref:opentracing.adoc#mongodb-client[OpenTracing - MongoDB client] section).
ja_jp: `quarkus-smallrye-opentracing` エクステンションを使用している場合、 `quarkus-mongodb-client` は実行されたコマンドについてのトレースを登録することができます。この動作を有効にするには、まず `application.properties` の `quarkus.mongodb.tracing.enabled` プロパティーを `true` に設定する必要があり、pom.xmlに `io.opentracing.contrib:opentracing-mongo-common` の依存関係を追加する必要があります (詳細は link:opentracing.html#mongodb-client[OpenTracing - MongoDB client]セクションをご覧ください)。

source: If you are using the `smallrye-graphql` extension and the `micrometer` metrics extension is present and metrics are enabled, you may encounter a `java.lang.NoClassDefFoundError` as some versions of the `smallrye-graphql` extension have runtime requirements on the Microprofile Metrics API. Add the following MicroProfile Metrics API dependency to resolve the issue:
ja_jp: `smallrye-graphql` エクステンションを使用していて、 `micrometer` メトリクスエクステンションが存在し、メトリクスが有効になっている場合、 `smallrye-graphql` エクステンションの一部のバージョンには Microprofile Metrics API のランタイム要件があるため、 `java.lang.NoClassDefFoundError` が発生する可能性があります。この問題を解決するには、次の Microprofile Metrics API の依存関係を追加します:

source: If you are using the `smallrye-health` extension, you can add the Health Endpoints to OpenAPI:
ja_jp: `smallrye-health` エクステンションを使用している場合は、OpenAPI にヘルスエンドポイントを追加することができます。

source: If you are using the active record pattern you cannot easily leverage `Mockito#mockStatic()` to mock static methods declared on `PanacheEntityBase`. In a normal Quarkus app, these static methods are automatically overridden in subclasses. However, `QuarkusComponentTest` does not start a full Quarkus application. Nevertheless, you can use the `quarkus-panache-mock` module which integrates seamlessly with `QuarkusComponentTest`.
ja_jp: アクティブレコードパターンを使用している場合、`Mockito#mockStatic()` を活用して `PanacheEntityBase` で宣言されたスタティックメソッドをモックすることは容易ではありません。通常の Quarkus アプリケーションでは、これらのスタティックメソッドはサブクラスで自動的にオーバーライドされます。しかし、`QuarkusComponentTest` は完全な Quarkus アプリケーションを起動しません。それにもかかわらず、`QuarkusComponentTest` とシームレスに統合される `quarkus-panache-mock` モジュールを使用できます。

source: If you are using the active record pattern you cannot use Mockito directly as it does not support mocking static methods, but you can use the `quarkus-panache-mock` module which allows you to use Mockito to mock all provided static methods, including your own.
ja_jp: アクティブレコードパターンを使用している場合、Mockitoは静的メソッドのモックをサポートしていないため、直接使用することはできませんが、 `quarkus-panache-mock` モジュールを使用することで、Mockitoを使用して、あなた自身のメソッドを含む、提供されたすべての静的メソッドをモックすることができます。

source: If you are using the active-record pattern you cannot use Mockito directly as it does not support mocking static methods, but you can use the `quarkus-panache-mock` module which allows you to use Mockito to mock all provided static methods, including your own.
ja_jp: active-recordパターンを使用している場合、Mockitoはスタティック・メソッドのモックをサポートしていないため、直接使用することはできませんが、 `quarkus-panache-mock` モジュールを使用することで、Mockitoを使用して、あなた自身のメソッドを含む、提供されたすべてのスタティック・メソッドをモックすることができます。

source: If you are using the quarkus-smallrye-health extension, the Infinispan client extensions will automatically add a readiness health check to validate the connection.
ja_jp: quarkus-smallrye-health エクステンションを使用している場合、Infinispan クライアントエクステンションは、接続を検証するためのReadinessヘルスチェックを自動的に追加します。

source: If you are using the repository pattern you can use Mockito directly, using the `quarkus-junit-mockito` module, which makes mocking beans much easier:
ja_jp: リポジトリー パターンを使用している場合、 `quarkus-junit-mockito` モジュールを使用して Mockito を直接使用できます。これにより、Bean のモックがはるかに簡単になります。

source: If you are using the repository pattern you can use Mockito directly, using the `quarkus-junit5-mockito` module, which makes mocking beans much easier:
ja_jp: リポジトリパターンを使用している場合は、 `quarkus-junit5-mockito` モジュールを使用して、Mockito を直接使用することができます。これにより、ビーンのモッキングが非常に簡単になります。

source: If you are using the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] or xref:smallrye-metrics.adoc[`quarkus-smallrye-metrics`] extension, `quarkus-agroal` can contribute some datasource-related metrics to the metric registry. This can be activated by setting the `quarkus.datasource.metrics.enabled` property to `true`.
ja_jp: xref:telemetry-micrometer.adoc[quarkus-micrometer] または xref:smallrye-metrics.adoc[quarkus-smallrye-metrics] エクステンションを使用している場合、 `quarkus-agroal` は、データソース関連のメトリックをメトリック・レジストリに貢献することができます。これは、 `quarkus.datasource.metrics.enabled` プロパティを `true` に設定することで有効になります。

source: If you are using these extensions, you are very welcome to contribute to them, now that the contribution is easier and doesn't require building the whole Quarkus!
ja_jp: これらのエクステンションを使用している場合は、それらへの貢献を歓迎します。

source: If you are using webjars, like the following JQuery one:
ja_jp: 以下の JQuery のように webjar を使用している場合を考えます。

source: If you are using xref:kafka-dev-services[Dev Services for Kafka], a Kafka broker will be started and available throughout the tests, unless it is disabled in `%test` profile. While it is possible to connect to this broker using Kafka Clients API, https://smallrye.io/smallrye-reactive-messaging/latest/kafka/test-companion/[Kafka Companion Library] proposes an easier way of interacting with a Kafka broker and, creating consumer, producer and admin actions inside tests.
ja_jp: xref:kafka-dev-services[Dev Services for Kafka] を使用している場合、 `%test` プロファイルで無効にされていない限り、Kafka ブローカーが起動し、テスト中に利用できます。Kafka Clients API を使用してこのブローカーに接続することもできますが、 link:https://smallrye.io/smallrye-reactive-messaging/latest/kafka/test-companion/[Kafka Companion Library] では、Kafka ブローカーと簡単にやり取りする方法を提案し、テスト内でコンシューマー、プロデューサー、管理者のアクションを作成します。

source: If you are working with your native image build, simply replace the template name with the native version:
ja_jp: ネイティブイメージのビルドで作業している場合は、テンプレート名をネイティブバージョンに置き換えてください。

source: If you aren't using Prometheus, you have a few options. Some Micrometer registry implementations have been wrapped in https://github.com/quarkiverse/quarkiverse-micrometer-registry[Quarkiverse extensions]. To use the Micrometer StackDriver MeterRegistry, for example, you would use the `quarkus-micrometer-registry-stackdriver` extension:
ja_jp: Prometheusを使用していない場合は、いくつかの選択肢があります。いくつかのMicrometerのレジストリーの実装は、 link:https://github.com/quarkiverse/quarkiverse-micrometer-registry[Quarkiverseのエクステンション] でラップされています。たとえば、Micrometer StackDriver MeterRegistryを使用するには、 `quarkiverse-micrometer-registry-stackdriver` エクステンションを使用します。

source: If you build native executables from your Quarkus applications, it is time to update to GraalVM 20.2, which is the recommended version from now on.
ja_jp: Quarkusのアプリケーションからネイティブ実行可能ファイルをビルドしている場合は、今から推奨バージョンであるGraalVM 20.2にアップデートする時期になっています。

source: If you build the project with:
ja_jp: 次のコマンドでプロジェクトをビルドする場合:

source: If you call the http://localhost:8080/hello[`/hello` endpoint] the related traces can be retrieved in the Jaeger UI at this address: http://localhost:16686/
ja_jp: http://localhost:8080/hello[`/hello` エンドポイント] を呼び出すと、関連するトレースを次のアドレスの Jaeger UI で取得できます: http://localhost:16686/

source: If you call this endpoint, you will wait and get a timeout. Indeed, no one is listening. So, we need a consumer listening on the `greeting` address. Create a `GreetingService` bean with the following content:
ja_jp: このエンドポイントを呼び出すと、しばらく待ってからタイムアウトになります。実際、誰もリスンしていません。そこで、 `greeting` アドレスをリスンするコンシューマーが必要です。以下の内容の `GreetingService` Bean を作成します。
